# Pandas Week 6

# 21. Agregasi pada Data Frame dengan agg()

In [2]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

In [3]:
#Data Frame Prep
df=pd.read_csv('./datasets/Iris.csv')
df

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

# Mengenal groupby() dan fungsi agregasi

- Fungsi agregasi adalah fungsi yang dikenakan pada sekelompok data. 
- Fungsi ini biasanya sangat berkaitan dengan mekanisme pengelompokan data atau groupby()

In [4]:
#contoh penggunaan fungsi agregasi count
df.groupby('Species')['PetalLengthCm'].count().to_frame()

                 PetalLengthCm
Species
Iris-setosa                 50
Iris-versicolor             50
Iris-virginica              50

In [5]:
#contoh penggunaan fungsi agregasi mean
df.groupby('Species')['PetalLengthCm'].mean().to_frame()

                 PetalLengthCm
Species
Iris-setosa              1.464
Iris-versicolor          4.260
Iris-virginica           5.552

In [6]:
#contoh penggunaan fungsi agregasi median
df.groupby('Species')['PetalLengthCm'].median().to_frame()

                 PetalLengthCm
Species
Iris-setosa               1.50
Iris-versicolor           4.35
Iris-virginica            5.55

Macam-Macam fungsi agregasi:
- Count  :berfungsi untuk menghitung jumlah baris
- Mean   :berfungsi untuk menghitung rata-rata
- Median :berfungsi untuk menghitung nilai tengah
- Sum    :berfungsi untuk menghitung total nilai
- Min    :berfungsi untuk mencari nilai terkecil
- Max    :berfungsi untuk mencari nilai terbesar
- std    :berfungsi untuk menghitung standar deviasi

# Agregasi dengan agg()

Fungsi agg() digunakan unutk menampilkan banyak fungsi agregasi

In [8]:
df.groupby('Species')['PetalLengthCm'].agg(['count','mean','max'])

                 count   mean  max
Species
Iris-setosa         50  1.464  1.9
Iris-versicolor     50  4.260  5.1
Iris-virginica      50  5.552  6.9

# Agregasi dengan describe()

Fungsi describe ini digunakan untuk menampilkan deskriptif statistic

In [9]:
df.groupby('Species')['PetalLengthCm'].describe()

                 count   mean       std  min  25%   50%    75%  max
Species
Iris-setosa       50.0  1.464  0.173511  1.0  1.4  1.50  1.575  1.9
Iris-versicolor   50.0  4.260  0.469911  3.0  4.0  4.35  4.600  5.1
Iris-virginica    50.0  5.552  0.551895  4.5  5.1  5.55  5.875  6.9

# 22. Memantau penggunaan memory pada Data Frame

In [1]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

Data Frame Prep

In [3]:
rf=pd.read_csv('./datasets/Iris.csv')
rf

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [4]:
tf=pd.read_csv('./datasets/titanicfull.csv')
tf

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S
...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,NaN,C
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,NaN,C
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S

note: rf untuk dataset iris dan tf untuk dataset titanicfull

# Memantau penggunaan memory pada  suatuData Frame

In [9]:
rf.info(memory_usage='Deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Id             150 non-null    int64
 1   SepalLengthCm  150 non-null    float64
 2   SepalWidthCm   150 non-null    float64
 3   PetalLengthCm  150 non-null    float64
 4   PetalWidthCm   150 non-null    float64
 5   Species        150 non-null    object
dtypes: float64(4), int64(1), object(1)
memory usage: 7.2+ KB

In [10]:
tf.info(memory_usage='Deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1309 non-null   int64
 1   survived  1309 non-null   int64
 2   name      1309 non-null   object
 3   sex       1309 non-null   object
 4   age       1046 non-null   float64
 5   sibsp     1309 non-null   int64
 6   parch     1309 non-null   int64
 7   ticket    1309 non-null   object
 8   fare      1308 non-null   float64
 9   cabin     295 non-null    object
 10  embarked  1307 non-null   object
dtypes: float64(2), int64(4), object(5)
memory usage: 112.6+ KB

- paramter memory_usage disini menggunkan 'Deep' yang berarti kita mau mengkalkulasi data usage sampai dengan dengan object terakhir yang ditampung dalam dataframe tersebut

# Memantau penggunaan memory untuk setiap kolom dari suatu Data Frame

In [13]:
rf.memory_usage(deep=True)

Index              128
Id                1200
SepalLengthCm     1200
SepalWidthCm      1200
PetalLengthCm     1200
PetalWidthCm      1200
Species          10550
dtype: int64

note: satuan yang digunakana dalah satuan byte

In [14]:
tf.memory_usage(deep=True)

Index          128
pclass       10472
survived     10472
name        110127
sex          80781
age          10472
sibsp        10472
parch        10472
ticket       83502
fare         10472
cabin        50366
embarked     75870
dtype: int64

# 23. Seleksi baris pada Data Frame dengan query()

In [15]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

In [23]:
#Data Frame Prep
d ={'Kolom_satu':[1,2,3,4,5],
   'Kolom_dua':[10,20,30,40,50]}
df=pd.DataFrame(d)
df

   Kolom_satu  Kolom_dua
0           1         10
1           2         20
2           3         30
3           4         40
4           5         50

# Seleksi baris dengan query()

In [24]:
df.query('Kolom_satu >2')

   Kolom_satu  Kolom_dua
2           3         30
3           4         40
4           5         50

In [25]:
df.query('Kolom_dua>30')

   Kolom_satu  Kolom_dua
3           4         40
4           5         50

note: nama variable kalau bisa jangan mengandung spasi bila mengandung spasi, harus ditulis menjadi seperti ini `nama variabel`

contoh variable yang menggunakan spasi

In [27]:
#Data Frame Prep
d ={'Kolom_satu':[1,2,3,4,5],
   'Kolom dua':[10,20,30,40,50]}
df=pd.DataFrame(d)
df

   Kolom_satu  Kolom dua
0           1         10
1           2         20
2           3         30
3           4         40
4           5         50

In [30]:
df.query('`Kolom dua`>30')

   Kolom_satu  Kolom dua
3           4         40
4           5         50